GD32-MCU-IOT/gd32_zephyr/include/zephyr/dt-bindings/clock/gd32h75e-clocks.h
/*
 * Copyright (c) 2026 GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32H75E_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32H75E_CLOCKS_H_

#include "gd32-clocks-common.h"

/**
 * @name Register offsets
 * @{
 */

#define GD32_AHB1EN_OFFSET      0x30U
#define GD32_AHB2EN_OFFSET      0x34U
#define GD32_AHB3EN_OFFSET      0x38U
#define GD32_AHB4EN_OFFSET      0x3CU
#define GD32_APB1EN_OFFSET      0x40U
#define GD32_APB2EN_OFFSET      0x44U
#define GD32_APB3EN_OFFSET      0x48U
#define GD32_APB4EN_OFFSET      0x4CU
#define GD32_AHB1SPEN_OFFSET    0x50U
#define GD32_AHB2SPEN_OFFSET    0x54U
#define GD32_AHB3SPEN_OFFSET    0x58U
#define GD32_AHB4SPEN_OFFSET    0x5CU
#define GD32_APB1SPEN_OFFSET    0x60U
#define GD32_APB2SPEN_OFFSET    0x64U
#define GD32_APB3SPEN_OFFSET    0x68U
#define GD32_APB4SPEN_OFFSET    0x6CU
#define GD32_BDCTL_OFFSET       0x70U
#define GD32_ADDAPB2EN_OFFSET   0xE4U
#define GD32_ADDAPB2SPEN_OFFSET 0xE8U
/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB peripherals */
#define GD32_CLOCK_ENET1      GD32_CLOCK_CONFIG(AHB1EN, 0U)
#define GD32_CLOCK_ENET1TX    GD32_CLOCK_CONFIG(AHB1EN, 1U)
#define GD32_CLOCK_ENET1RX    GD32_CLOCK_CONFIG(AHB1EN, 2U)
#define GD32_CLOCK_ENET1PTP   GD32_CLOCK_CONFIG(AHB1EN, 3U)
#define GD32_CLOCK_USBHS0     GD32_CLOCK_CONFIG(AHB1EN, 14U)
#define GD32_CLOCK_USBHS0ULPI GD32_CLOCK_CONFIG(AHB1EN, 15U)
#define GD32_CLOCK_DMA0       GD32_CLOCK_CONFIG(AHB1EN, 21U)
#define GD32_CLOCK_DMA1       GD32_CLOCK_CONFIG(AHB1EN, 22U)
#define GD32_CLOCK_DMAMUX     GD32_CLOCK_CONFIG(AHB1EN, 23U)
#define GD32_CLOCK_ENET0      GD32_CLOCK_CONFIG(AHB1EN, 25U)
#define GD32_CLOCK_ENET0TX    GD32_CLOCK_CONFIG(AHB1EN, 26U)
#define GD32_CLOCK_ENET0RX    GD32_CLOCK_CONFIG(AHB1EN, 27U)
#define GD32_CLOCK_ENET0PTP   GD32_CLOCK_CONFIG(AHB1EN, 28U)
#define GD32_CLOCK_USBHS1     GD32_CLOCK_CONFIG(AHB1EN, 29U)
#define GD32_CLOCK_USBHS1ULPI GD32_CLOCK_CONFIG(AHB1EN, 30U)

/* AHB2 peripherals */
#define GD32_CLOCK_DCI       GD32_CLOCK_CONFIG(AHB2EN, 0U)
#define GD32_CLOCK_FAC       GD32_CLOCK_CONFIG(AHB2EN, 1U)
#define GD32_CLOCK_SDIO1     GD32_CLOCK_CONFIG(AHB2EN, 2U)
#define GD32_CLOCK_CAU       GD32_CLOCK_CONFIG(AHB2EN, 3U)
#define GD32_CLOCK_HAU       GD32_CLOCK_CONFIG(AHB2EN, 4U)
#define GD32_CLOCK_TRNG      GD32_CLOCK_CONFIG(AHB2EN, 6U)
#define GD32_CLOCK_TMU       GD32_CLOCK_CONFIG(AHB2EN, 7U)
#define GD32_CLOCK_RAMECCMU1 GD32_CLOCK_CONFIG(AHB2EN, 8U)

/* AHB3 peripherals */
#define GD32_CLOCK_EXMC      GD32_CLOCK_CONFIG(AHB3EN, 0U)
#define GD32_CLOCK_IPA       GD32_CLOCK_CONFIG(AHB3EN, 1U)
#define GD32_CLOCK_SDIO0     GD32_CLOCK_CONFIG(AHB3EN, 2U)
#define GD32_CLOCK_MDMA      GD32_CLOCK_CONFIG(AHB3EN, 3U)
#define GD32_CLOCK_OSPIM     GD32_CLOCK_CONFIG(AHB3EN, 4U)
#define GD32_CLOCK_OSPI0     GD32_CLOCK_CONFIG(AHB3EN, 5U)
#define GD32_CLOCK_OSPI1     GD32_CLOCK_CONFIG(AHB3EN, 6U)
#define GD32_CLOCK_RTDEC0    GD32_CLOCK_CONFIG(AHB3EN, 8U)
#define GD32_CLOCK_RTDEC1    GD32_CLOCK_CONFIG(AHB3EN, 9U)
#define GD32_CLOCK_RAMECCMU0 GD32_CLOCK_CONFIG(AHB3EN, 10U)
#define GD32_CLOCK_CPU       GD32_CLOCK_CONFIG(AHB3EN, 15U)

/* AHB4 peripherals */
#define GD32_CLOCK_GPIOA   GD32_CLOCK_CONFIG(AHB4EN, 0U)
#define GD32_CLOCK_GPIOB   GD32_CLOCK_CONFIG(AHB4EN, 1U)
#define GD32_CLOCK_GPIOC   GD32_CLOCK_CONFIG(AHB4EN, 2U)
#define GD32_CLOCK_GPIOD   GD32_CLOCK_CONFIG(AHB4EN, 3U)
#define GD32_CLOCK_GPIOE   GD32_CLOCK_CONFIG(AHB4EN, 4U)
#define GD32_CLOCK_GPIOF   GD32_CLOCK_CONFIG(AHB4EN, 5U)
#define GD32_CLOCK_GPIOG   GD32_CLOCK_CONFIG(AHB4EN, 6U)
#define GD32_CLOCK_GPIOH   GD32_CLOCK_CONFIG(AHB4EN, 7U)
#define GD32_CLOCK_GPIOJ   GD32_CLOCK_CONFIG(AHB4EN, 8U)
#define GD32_CLOCK_GPIOK   GD32_CLOCK_CONFIG(AHB4EN, 9U)
#define GD32_CLOCK_BKPSRAM GD32_CLOCK_CONFIG(AHB4EN, 13U)
#define GD32_CLOCK_CRC     GD32_CLOCK_CONFIG(AHB4EN, 14U)
#define GD32_CLOCK_HWSEM   GD32_CLOCK_CONFIG(AHB4EN, 15U)

/* APB1 peripherals */
#define GD32_CLOCK_TIMER1  GD32_CLOCK_CONFIG(APB1EN, 0U)
#define GD32_CLOCK_TIMER2  GD32_CLOCK_CONFIG(APB1EN, 1U)
#define GD32_CLOCK_TIMER3  GD32_CLOCK_CONFIG(APB1EN, 2U)
#define GD32_CLOCK_TIMER4  GD32_CLOCK_CONFIG(APB1EN, 3U)
#define GD32_CLOCK_TIMER5  GD32_CLOCK_CONFIG(APB1EN, 4U)
#define GD32_CLOCK_TIMER6  GD32_CLOCK_CONFIG(APB1EN, 5U)
#define GD32_CLOCK_TIMER22 GD32_CLOCK_CONFIG(APB1EN, 6U)
#define GD32_CLOCK_TIMER23 GD32_CLOCK_CONFIG(APB1EN, 7U)
#define GD32_CLOCK_TIMER30 GD32_CLOCK_CONFIG(APB1EN, 8U)
#define GD32_CLOCK_TIMER31 GD32_CLOCK_CONFIG(APB1EN, 9U)
#define GD32_CLOCK_TIMER50 GD32_CLOCK_CONFIG(APB1EN, 10U)
#define GD32_CLOCK_TIMER51 GD32_CLOCK_CONFIG(APB1EN, 11U)
#define GD32_CLOCK_RSPDIF  GD32_CLOCK_CONFIG(APB1EN, 13U)
#define GD32_CLOCK_SPI1    GD32_CLOCK_CONFIG(APB1EN, 14U)
#define GD32_CLOCK_SPI2    GD32_CLOCK_CONFIG(APB1EN, 15U)
#define GD32_CLOCK_MDIO    GD32_CLOCK_CONFIG(APB1EN, 16U)
#define GD32_CLOCK_USART1  GD32_CLOCK_CONFIG(APB1EN, 17U)
#define GD32_CLOCK_USART2  GD32_CLOCK_CONFIG(APB1EN, 18U)
#define GD32_CLOCK_UART3   GD32_CLOCK_CONFIG(APB1EN, 19U)
#define GD32_CLOCK_UART4   GD32_CLOCK_CONFIG(APB1EN, 20U)
#define GD32_CLOCK_I2C0    GD32_CLOCK_CONFIG(APB1EN, 21U)
#define GD32_CLOCK_I2C1    GD32_CLOCK_CONFIG(APB1EN, 22U)
#define GD32_CLOCK_I2C2    GD32_CLOCK_CONFIG(APB1EN, 23U)
#define GD32_CLOCK_I2C3    GD32_CLOCK_CONFIG(APB1EN, 24U)
#define GD32_CLOCK_CTC     GD32_CLOCK_CONFIG(APB1EN, 27U)
#define GD32_CLOCK_DACHOLD GD32_CLOCK_CONFIG(APB1EN, 28U)
#define GD32_CLOCK_DAC     GD32_CLOCK_CONFIG(APB1EN, 29U)
#define GD32_CLOCK_UART6   GD32_CLOCK_CONFIG(APB1EN, 30U)
#define GD32_CLOCK_UART7   GD32_CLOCK_CONFIG(APB1EN, 31U)

/* APB2 peripherals */
#define GD32_CLOCK_TIMER0  GD32_CLOCK_CONFIG(APB2EN, 0U)
#define GD32_CLOCK_TIMER7  GD32_CLOCK_CONFIG(APB2EN, 1U)
#define GD32_CLOCK_USART0  GD32_CLOCK_CONFIG(APB2EN, 4U)
#define GD32_CLOCK_USART5  GD32_CLOCK_CONFIG(APB2EN, 5U)
#define GD32_CLOCK_ADC0    GD32_CLOCK_CONFIG(APB2EN, 8U)
#define GD32_CLOCK_ADC1    GD32_CLOCK_CONFIG(APB2EN, 9U)
#define GD32_CLOCK_ADC2    GD32_CLOCK_CONFIG(APB2EN, 10U)
#define GD32_CLOCK_SPI0    GD32_CLOCK_CONFIG(APB2EN, 12U)
#define GD32_CLOCK_SPI3    GD32_CLOCK_CONFIG(APB2EN, 13U)
#define GD32_CLOCK_TIMER14 GD32_CLOCK_CONFIG(APB2EN, 16U)
#define GD32_CLOCK_TIMER15 GD32_CLOCK_CONFIG(APB2EN, 17U)
#define GD32_CLOCK_TIMER16 GD32_CLOCK_CONFIG(APB2EN, 18U)
#define GD32_CLOCK_HPDF    GD32_CLOCK_CONFIG(APB2EN, 19U)
#define GD32_CLOCK_SPI4    GD32_CLOCK_CONFIG(APB2EN, 20U)
#define GD32_CLOCK_SPI5    GD32_CLOCK_CONFIG(APB2EN, 21U)
#define GD32_CLOCK_SAI0    GD32_CLOCK_CONFIG(APB2EN, 22U)
#define GD32_CLOCK_SAI1    GD32_CLOCK_CONFIG(APB2EN, 23U)
#define GD32_CLOCK_SAI2    GD32_CLOCK_CONFIG(APB2EN, 24U)
#define GD32_CLOCK_TIMER40 GD32_CLOCK_CONFIG(APB2EN, 25U)
#define GD32_CLOCK_TIMER41 GD32_CLOCK_CONFIG(APB2EN, 26U)
#define GD32_CLOCK_TIMER42 GD32_CLOCK_CONFIG(APB2EN, 27U)
#define GD32_CLOCK_TIMER43 GD32_CLOCK_CONFIG(APB2EN, 28U)
#define GD32_CLOCK_TIMER44 GD32_CLOCK_CONFIG(APB2EN, 29U)
#define GD32_CLOCK_EDOUT   GD32_CLOCK_CONFIG(APB2EN, 30U)
#define GD32_CLOCK_TRIGSEL GD32_CLOCK_CONFIG(APB2EN, 31U)

/* APB3 peripherals */
#define GD32_CLOCK_TLI   GD32_CLOCK_CONFIG(APB3EN, 0U)
#define GD32_CLOCK_WWDGT GD32_CLOCK_CONFIG(APB3EN, 1U)

/* APB4 peripherals */
#define GD32_CLOCK_SYSCFG GD32_CLOCK_CONFIG(APB4EN, 0U)
#define GD32_CLOCK_CMP    GD32_CLOCK_CONFIG(APB4EN, 1U)
#define GD32_CLOCK_VREF   GD32_CLOCK_CONFIG(APB4EN, 2U)
#define GD32_CLOCK_LPDTS  GD32_CLOCK_CONFIG(APB4EN, 3U)
#define GD32_CLOCK_PMU    GD32_CLOCK_CONFIG(APB4EN, 4U)
#define GD32_CLOCK_RTC    GD32_CLOCK_CONFIG(BDCTL, 15U)

/* APB2 additional peripherals */
#define GD32_CLOCK_CAN0 GD32_CLOCK_CONFIG(ADDAPB2EN, 0U)
#define GD32_CLOCK_CAN1 GD32_CLOCK_CONFIG(ADDAPB2EN, 1U)
#define GD32_CLOCK_CAN2 GD32_CLOCK_CONFIG(ADDAPB2EN, 2U)

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32H75E_CLOCKS_H_ */
